In [ ]:
#objective: Can you predict the fuel-efficieny of a car?

In [2]:
#load libraries
import pandas as pd
import numpy as np
import sklearn
import seaborn as sns
from sklearn import preprocessing
from sklearn.metrics import accuracy_score
from sklearn.metrics import roc_curve, auc, recall_score, precision_score, f1_score, confusion_matrix, recall_score
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import model_selection
from sklearn.tree import DecisionTreeClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LinearRegression
from sklearn import linear_model

In [18]:
#load data
df = pd.read_table('../datasets/auto_mpg.data', sep=",", header=None)

In [19]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,18.0,8,307.0,NaN,130.0,NaN,3504.0,NaN,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,NaN,165.0,NaN,3693.0,NaN,11.5,70,1,buick skylark 320
2,18.0,8,318.0,NaN,150.0,NaN,3436.0,NaN,11.0,70,1,plymouth satellite
3,16.0,8,304.0,NaN,150.0,NaN,3433.0,NaN,12.0,70,1,amc rebel sst
4,17.0,8,302.0,NaN,140.0,NaN,3449.0,NaN,10.5,70,1,ford torino

In [22]:
df[11]

0              chevrolet chevelle malibu
1                      buick skylark 320
2                     plymouth satellite
3                          amc rebel sst
4                            ford torino
5                       ford galaxie 500
6                       chevrolet impala
7                      plymouth fury iii
8                       pontiac catalina
9                     amc ambassador dpl
10                   dodge challenger se
11                    plymouth 'cuda 340
12                 chevrolet monte carlo
13               buick estate wagon (sw)
14                 toyota corona mark ii
15                       plymouth duster
16                            amc hornet
17                         ford maverick
18                          datsun pl510
19          volkswagen 1131 deluxe sedan
20                           peugeot 504
21                           audi 100 ls
22                              saab 99e
23                              bmw 2002
24                           amc gremlin
25                             ford f250
26                             chevy c20
27                            dodge d200
28                              hi 1200d
29                          datsun pl510
                     ...
362                   chevrolet cavalier
363             chevrolet cavalier wagon
364            chevrolet cavalier 2-door
365           pontiac j2000 se hatchback
366                       dodge aries se
367                      pontiac phoenix
368                 ford fairmont futura
369                  volkswagen rabbit l
370                   mazda glc custom l
371                     mazda glc custom
372               plymouth horizon miser
373                       mercury lynx l
374                     nissan stanza xe
375                         honda accord
376                       toyota corolla
377                          honda civic
378                   honda civic (auto)
379                        datsun 310 gx
380                buick century limited
381    oldsmobile cutlass ciera (diesel)
382           chrysler lebaron medallion
383                       ford granada l
384                     toyota celica gt
385                    dodge charger 2.2
386                     chevrolet camaro
387                      ford mustang gl
388                            vw pickup
389                        dodge rampage
390                          ford ranger
391                           chevy s-10
Name: 11, Length: 392, dtype: object

In [24]:
#df[7].drop()
df = df.drop([7,5,3],axis = 1)

In [25]:
df.head()

     0   1      2      4       6     8   9   10                         11
0  18.0   8  307.0  130.0  3504.0  12.0  70   1  chevrolet chevelle malibu
1  15.0   8  350.0  165.0  3693.0  11.5  70   1          buick skylark 320
2  18.0   8  318.0  150.0  3436.0  11.0  70   1         plymouth satellite
3  16.0   8  304.0  150.0  3433.0  12.0  70   1              amc rebel sst
4  17.0   8  302.0  140.0  3449.0  10.5  70   1                ford torino

In [26]:
df = df.drop(11,axis = 1)

In [27]:
df.columns = ['mpg','cylinders','displacement','horsepower','weight',
              'accelaeration','model_year','origin']

In [28]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,accelaeration,model_year,origin
0,18.0,8,307.0,130.0,3504.0,12.0,70,1
1,15.0,8,350.0,165.0,3693.0,11.5,70,1
2,18.0,8,318.0,150.0,3436.0,11.0,70,1
3,16.0,8,304.0,150.0,3433.0,12.0,70,1
4,17.0,8,302.0,140.0,3449.0,10.5,70,1

In [1]:
#check for missing data
nan_rows = df.isnull().T.any().T.sum()
#drop missing data
df = df.dropna()

NameError: name 'df' is not defined

In [ ]:
#check for